{
  "navbar": {
    "contact-link": "Yhteystiedot"
  },

  "profile": {
    "profile-content-h2": "Hauska tutustua!",
    "profile-content-p1": "Olen Otto ja olen hyvin kiinnostunut kehittämään toimivia, luotettavia ja moderneja ratkaisuja. Opiskelen HAMK:ssa tietojenkäsittelyä ja lisäksi käytän vapaa-aikaani paljon osaamiseni kehittämiseen erilaisten projektien muodossa. Olen erityisen kiinnostunut Back-end kehittämisestä, mutta uskon että toimivat tausta-ratkaisut ansaitsevat miellyttävän ulkoasun.",
    "profile-content-p2": "Jos kiinnostuit, lue toki lisää alta!"
  },

  "about": {
    "about-header-1": "Taustaa",
    "about-text-1": " Suhtaudun tietojenkäsittelyyn intohimoisesti. Jo ennen opintojeni alkua opiskelin itsenäisesti ohjelmoinnin alkeita. Olen kartuttanut osaamistani useilla eri osa-alueilla enkä ole löytänyt aihetta, joka ei kiinnostaisi. Käytän englantia erittäin sujuvasti sekä kirjallisesti että suullisesti. Ohjelmoinnin lisäksi nautin golf-kierroksista, kitaran soitosta, lautapeleistä sekä perheen kanssa matkustamisesta.",
    "about-header-2": "Lähestymiseni ohjelmointiin",
    "about-text-2": " Jatkuva uuden tiedon kerääminen ja osaamisen kartuttaminen omien projektien avulla on minulle tärkeää. Olen tehnyt projekteja, jotka ovat tärkeitä oppimisen näkökulmasta. Elegantti funktio, kaunis animaatio ja toimiva tiimi ovat asioita, jotka houkuttelevat tarttumaan uusiin haasteisiin uudestaan ja uudestaan.",
    "about-header-3": "Koulutus",
    "about-text-3": " Koulutukseni Hämeenlinnan ammattikorkeakoulussa on tarjonnut minulle useita hyödyllisiä kursseja ja projekteja, joissa olen oppinut paljon ryhmässä työskentelemisestä. Useissa projekteissa on ollut käytössä versionhallintatyökalut (git) ja Agile-työskentelytavat (Scrum), joten nämä ovat tulleet tutuiksi. Alle olen listannut projekteja ja kursseja, joille olen osallistunut.",
    "about-subject-1": "Azure-projekti - Intranet autokaupalle",
    "about-subject-2": "Agile/Scrum perusteet",
    "about-subject-3": "Java OOP perusteet",
    "about-subject-4": "Diili-projekti - Road to Vostok bug report system ideointi",
    "about-subject-5": "Käyttöjärjestelmien perusteet Linux, Windows",
    "about-subject-6": "Tietojärjestelmien ja tietoturvallisuuden perusteet",
    "about-subject-7": "Wordpress-projekti",
    "about-subject-8": "Datan analysointi Pythonilla (matplotlib, pandas)"
  },

  "demo": {
    "demo-text-1": "Jokavuotisen golfkilpailumme järjestäminen osui kohdalleni. En löytänyt valmista appia joukkueiden arpomiseen golfin viitekehyksessä, joten päätin rakentaa sellaisen! Samalla projekti osoittautui loistavaksi mahdollisuudeksi opetella noSQL-tietokannoista ja State Management-kirjastosta. React JS, MongoDB, Redux, Express.",
    "demo-text-2": "Projekti, jossa tarkoitus oli harjoitella Reactia ja TypeScriptiä. Tarkoituksena oli luoda laskuri, jossa on useita eri lopputulokseen vaikuttavia laskutoimituksia. Mm. Korin hinta, matkan pituus, tuotteiden määrä, päivä ja aika vaikuttavat lopulliseen hintaan. Vahvasti tyypitettynä!",
    "demo-text-3": "Yksi ensimmäisistä harjoituksista React-ympäristössä, jossa mukana myös public API. Klassinen tutorial-projekti, jossa pyrin tekemään oman näköisen ratkaisun. Tietoinen päätös olla seuraamatta orjallisesti ohjeita opetti paljon.",
    "demo-text-4": "You are looking at it! Staattinen verkkosivu projektieni, osaamiseni ja itseni esittelemiseksi. OnePage ratkaisu on toteutettu käyttäen React JS, CSS, HTML.",
    "demo-text-5": "Projekti jossa yhdessä kokeneemman kehittäjän kanssa pyrimme helpottamaan ihmisten muistamiseen liittyviä ongelmia. Olen projektissa vastuussa backend-ratkaisuista. Flask, SQLAlchemy, JWT, MySql, TypeScript, ExpoReact, AWS s3.",
    "repo-text": "Repository"
  }
}
